DEBUG = False

version = 'DEV0.3'

abt_msg = '''
    Hi
    我是此项目的创建者,NTG(NTGtechGroup，简称还是NTG)
    首先，感谢您下载此软件，此软件耗时5小时建成

    制作仓促，若有bug还请见谅( *^-^)ρ(*╯^╰)
    发现BUG，请按照我的联系方式与我反馈
    清表明您的来意，提交BUG时请说明您的步骤
    (若能提交cookie是最好的，但如果您怕个人信息泄露大可不必)

    喜欢，请赞助我
    最后，祝您生活愉快ヾ(≧▽≦*)o

    QQ:3052381496
    mail:3052381496@qq.com

    Rev : ''' + version + '''

    更新日志-
        Bse 0.0
            仅供己用,利用TAG爬取,简单粗暴
        Dev 0.1
            梦开始的地方
            添加了UI
            添加了跳过之前下过的文件的功能
            对外开放
        Dev 0.2-功能性更新
            添加主界面
            添加了爬取画师全部画作的功能
            添加了标签筛选的功能（不推荐，慢）
            添加了RQcode生成模块
            修改Full模式为Stag
            修复了画师画作在48以下时无法下载的问题
        Dev0.3-英特尔式更新
            0.2版本源码丢失，代码重构
            添加了用户协议
            添加了非强迫性更新
    '''


policy = '''
版权声明 
1、本软件(不包含访问的服务器、访问的页面、您下载的图片)版权均属作者个人所有，任何媒体、网站或个人未经本网协议授权不得转载、链接、转贴或以其他方式复制发布/发表。已经本人协议授权的媒体、网站，在下载使用时必须注明来源，违者本人将依法追究责任。
2、除注明来源外，以下内容亦不可任意转载： a.本网所指向的非本人内容的相关链接内容；  b.已作出不得转载或未经许可不得转载声明的内容； c. 其他法律不允许或本人认为不适合转载的内容。
3、转载或引用本人内容不得进行如下活动： a. 损害本人或他人利益； b. 任何违法行为； 
c. 任何可能破坏公秩良俗的行为； d. 擅自同意他人继续转载、引用本人内容； 
5对于不当转载或引用本网内容而引起的民事纷争、行政处理或其他损失，本人不承担责任。

6、对不遵守本声明或其他违法、恶意使用本人内容者，本人保留追究其法律责任的权利 
                                                             
NTGtechGroup 
                                             2021年8月1日 

用户使用服务协议
本协议约定PTD!与用户之间关于“文件下载”服务（以下简称“服务”）的权利义务。“用户”是指注册、登录、使用本服务的个人、单位。本协议可由PTD!随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本APP中查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用PTD!提供的服务，用户继续使用PTD!提供的服务将被视为接受修改后的协议。
1、鉴于本软件本软件特殊定位，本人有权在不通知您的情况下停止对您的服务
2、本软件不会存储您的任何信息到云端
3、对于传播利用此软件下载的不良信息【(1)违反宪法所确定的基本原则的； 
(2)危害国家安全,泄露国家秘密,颠覆国家政权,破坏国家统一的； (3)损害国家荣誉和利益的； 
(4)煽动民族仇恨、民族歧视,破坏民族团结的； (5)破坏国家宗教政策,宣扬邪教和封建迷信的； (6)散布谣言,扰乱社公秩序,破坏社会稳定的； 
(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； (8)侮辱或者诽谤他人,侵害他人合法权益的； (9)含有法律、行政法规禁止的其他内容的。】，本人一概不担责
'''

say_text = 'Hi, 这只是个用来在程序还在加载时用于充数的句子，过会就会消失请不要有过多疑虑'

